app/Controllers/Home.php

    public function index()
    {
        // Fetch all users from the database
        $builder = $this->db->table('user');
        $data['users'] = $builder->get()->getResultArray();
---
SELECT *
FROM `user`

    public function addData()
    {
        $data = [
            'name' => $this->request->getPost('name'),
            'mobile_number' => $this->request->getPost('mobile_number'),
            'email' => $this->request->getPost('email'),
        ];

        $builder = $this->db->table('user');
        if ($builder->insert($data)) {
---
INSERT INTO `user` (`name`, `mobile_number`, `email`) VALUES ('Yogesh Shahaji Bachute ', '958529525', '42nikitagund@gmail.com')

    public function edit($id)
    {
        $builder = $this->db->table('user');
        $data['edit'] = $builder->getWhere(['id' => $id])->getRowArray();
---
SELECT *
FROM `user`
WHERE `id` = '3'

    public function update($id)
    {
        $data = [
            'name' => $this->request->getPost('name'),
            'mobile_number' => $this->request->getPost('mobile_number'),
            'email' => $this->request->getPost('email'),
        ];

        $builder = $this->db->table('user');
        if ($builder->update($data, ['id' => $id])) {
---
UPDATE `user` SET `name` = 'Yogesh Shahaji Bachute ', `mobile_number` = '21474836475', `email` = 'bachuteyogesh5@gmail.com'
WHERE `id` = '3'